package LB_1;

class Main {
    public static void main(String[] args) {

        // TASK 1
// Визначити число від’ємних елементів, що розташовані перед найбільшим додатнім елементом одномірного масиву, розмірності N.
// Якщо шукане число від’ємних елементів буде дорівнювати 0, то відсортувати у спадному порядку елементи розташовані
// після найбільшого додатного елемента.

//        System.out.println("Задание №1");
//        task_1.main();

        // TASK 2
// В матриці А знайти відношення кількості додатних елементів до кількості від’ємних. Матрицю В утворити з матриці А,
// відобразивши її симетрично відносно середнього рядка.

//        System.out.println("\n\nЗадание №2");
//        task_2.main();

        // TASK 3
// Задано матрицю А={aij} розмірності mn. Скласти функцію для побудови логічного вектора B={bi}  за наступним правилом:
// якщо у рядку з номером k кількість додатних елементів більша ніж кількість від’ємних, то bk=1(true), інакше bk=0(false).
// Потім необхідно розташувати елементи кожного стовпця масиву А у порядку збільшення.

//        System.out.println("\n\nЗадание №3");
//        task_3.main();
    }
}