package LB_2;

public class Main {
    public static void main(String[] args) {

        //TASK 1
//  Написати регулярний вираз, який визначає чи є заданий рядок  датою у форматі dd/mm/yyyy. Починаючи з 1600 року до 9999 року.
//  – приклад правильних виразів: 29/02/2000, 30/04/2003, 01/01/2003.
//  – приклад неправильних виразів: 29/02/2001, 30-04-2003, 1/1/1899

        System.out.println("Проверка формата даты:\n");
        task_1.main();

        //TASK 2
//  Вводити масив рядків, довжина яких не більше певного числа.
//  Знайти рядок найменшої довжини і вирівняти всі рядки до  довжини найменшого рядка.

        System.out.println("\nРабота со строками:\n");
        task_2.main();
    }
}
